[Timeout] BlockStatement
src/polls.js:7:31
 
 const Polls = module.exports;
 
-function addPercentages(poll) {
-	const totalVotes = parseInt(poll.totalVotes, 10) || 0;
-	poll.options = poll.options.map(option => ({
-		...option,
-		percentage: totalVotes > 0 ? Math.round((option.votes / totalVotes) * 100) : 0,
-	}));
-	return poll;
-}
+function addPercentages(poll) {}
 
 //create a new poll

[Timeout] ConditionalExpression
src/polls.js:8:21
 const Polls = module.exports;
 
 function addPercentages(poll) {
-	const totalVotes = parseInt(poll.totalVotes, 10) || 0;
+	const totalVotes = false;
 	poll.options = poll.options.map(option => ({
 		...option,

[Timeout] LogicalOperator
src/polls.js:8:21
 const Polls = module.exports;
 
 function addPercentages(poll) {
-	const totalVotes = parseInt(poll.totalVotes, 10) || 0;
+	const totalVotes = parseInt(poll.totalVotes, 10) && 0;
 	poll.options = poll.options.map(option => ({
 		...option,

[Timeout] ArrowFunction
src/polls.js:9:34
 
 function addPercentages(poll) {
 	const totalVotes = parseInt(poll.totalVotes, 10) || 0;
-	poll.options = poll.options.map(option => ({
-		...option,
-		percentage: totalVotes > 0 ? Math.round((option.votes / totalVotes) * 100) : 0,
-	}));
+	poll.options = poll.options.map(() => undefined);
 	return poll;
 }

[Timeout] ObjectLiteral
src/polls.js:9:45
 
 function addPercentages(poll) {
 	const totalVotes = parseInt(poll.totalVotes, 10) || 0;
-	poll.options = poll.options.map(option => ({
-		...option,
-		percentage: totalVotes > 0 ? Math.round((option.votes / totalVotes) * 100) : 0,
-	}));
+	poll.options = poll.options.map(option => ({}));
 	return poll;
 }

[Killed] ArithmeticOperator
src/polls.js:11:43
 	const totalVotes = parseInt(poll.totalVotes, 10) || 0;
 	poll.options = poll.options.map(option => ({
 		...option,
-		percentage: totalVotes > 0 ? Math.round((option.votes / totalVotes) * 100) : 0,
+		percentage: totalVotes > 0 ? Math.round(option.votes / totalVotes / 100) : 0,
 	}));
 	return poll;
statusReason: Listen method has been called more than once without closing.

[Killed] ArithmeticOperator
src/polls.js:11:44
 	const totalVotes = parseInt(poll.totalVotes, 10) || 0;
 	poll.options = poll.options.map(option => ({
 		...option,
-		percentage: totalVotes > 0 ? Math.round((option.votes / totalVotes) * 100) : 0,
+		percentage: totalVotes > 0 ? Math.round((option.votes * totalVotes) * 100) : 0,
 	}));
 	return poll;
statusReason: Listen method has been called more than once without closing.

[Killed] LogicalOperator
src/polls.js:21:6
 	const { title, question, options, creatorUid } = pollData;
 
 	//check if input is valid
-	if (!title || !question || !options || !Array.isArray(options) || options.length < 2) {
+	if ((!title || !question || !options) && !Array.isArray(options) || options.length < 2) {
 		throw new Error('Poll data not valid, need title, question, and at least 2 options');
 	}
killedBy: Polls .create() should throw if title is missing
statusReason: Missing expected rejection.

[Killed] ConditionalExpression
src/polls.js:21:6
 	const { title, question, options, creatorUid } = pollData;
 
 	//check if input is valid
-	if (!title || !question || !options || !Array.isArray(options) || options.length < 2) {
+	if (true) {
 		throw new Error('Poll data not valid, need title, question, and at least 2 options');
 	}
statusReason: Poll data not valid, need title, question, and at least 2 options

[Killed] StringLiteral
src/polls.js:26:17
 	}
 
 	const timestamp = Date.now();
-	const pollId = `poll:${timestamp}`;
+	const pollId = ``;
 
 	//poll object
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/polls.js:33:39
 		pollId: pollId,
 		title: title,
 		question: question,
-		options: JSON.stringify(options.map((option, index) => ({
-			optionId: index,
-			text: option,
-			votes: 0,
-		}))),
+		options: JSON.stringify(options.map(() => undefined)),
 		creatorUid: creatorUid,
 		timestamp: timestamp,
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/polls.js:33:59
 		pollId: pollId,
 		title: title,
 		question: question,
-		options: JSON.stringify(options.map((option, index) => ({
-			optionId: index,
-			text: option,
-			votes: 0,
-		}))),
+		options: JSON.stringify(options.map((option, index) => ({}))),
 		creatorUid: creatorUid,
 		timestamp: timestamp,
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/polls.js:53:42
 };
 
 //get a poll by ID
-Polls.get = async function (pollId, uid) {
-	const poll = await db.getObject(pollId);
-	if (!poll) {
-		throw new Error('Poll not found');
-	}
-	if (poll.options) {
-		poll.options = JSON.parse(poll.options);
-	}
-	poll.hasVoted = await db.isSetMember(`${pollId}:voters`, uid);
-	poll.isCreator = uid !== undefined && String(poll.creatorUid) === String(uid);
-	poll.isClosed = poll.isClosed === 1 || poll.isClosed === '1';
-	addPercentages(poll);
-	return poll;
-};
+Polls.get = async function (pollId, uid) {};
 
 //get all polls
statusReason: Listen method has been called more than once without closing.

[Killed] BooleanLiteral
src/polls.js:55:6
 //get a poll by ID
 Polls.get = async function (pollId, uid) {
 	const poll = await db.getObject(pollId);
-	if (!poll) {
+	if (poll) {
 		throw new Error('Poll not found');
 	}
statusReason: Listen method has been called more than once without closing.

[Killed] BlockStatement
src/polls.js:55:13
 //get a poll by ID
 Polls.get = async function (pollId, uid) {
 	const poll = await db.getObject(pollId);
-	if (!poll) {
-		throw new Error('Poll not found');
-	}
+	if (!poll) {}
 	if (poll.options) {
 		poll.options = JSON.parse(poll.options);
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/polls.js:58:6
 	if (!poll) {
 		throw new Error('Poll not found');
 	}
-	if (poll.options) {
+	if (true) {
 		poll.options = JSON.parse(poll.options);
 	}
statusReason: Listen method has been called more than once without closing.

[Killed] BlockStatement
src/polls.js:58:20
 	if (!poll) {
 		throw new Error('Poll not found');
 	}
-	if (poll.options) {
-		poll.options = JSON.parse(poll.options);
-	}
+	if (poll.options) {}
 	poll.hasVoted = await db.isSetMember(`${pollId}:voters`, uid);
 	poll.isCreator = uid !== undefined && String(poll.creatorUid) === String(uid);
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/polls.js:62:19
 		poll.options = JSON.parse(poll.options);
 	}
 	poll.hasVoted = await db.isSetMember(`${pollId}:voters`, uid);
-	poll.isCreator = uid !== undefined && String(poll.creatorUid) === String(uid);
+	poll.isCreator = true;
 	poll.isClosed = poll.isClosed === 1 || poll.isClosed === '1';
 	addPercentages(poll);
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/polls.js:62:19
 		poll.options = JSON.parse(poll.options);
 	}
 	poll.hasVoted = await db.isSetMember(`${pollId}:voters`, uid);
-	poll.isCreator = uid !== undefined && String(poll.creatorUid) === String(uid);
+	poll.isCreator = true && String(poll.creatorUid) === String(uid);
 	poll.isClosed = poll.isClosed === 1 || poll.isClosed === '1';
 	addPercentages(poll);
statusReason: Listen method has been called more than once without closing.

[Killed] EqualityOperator
src/polls.js:63:18
 	}
 	poll.hasVoted = await db.isSetMember(`${pollId}:voters`, uid);
 	poll.isCreator = uid !== undefined && String(poll.creatorUid) === String(uid);
-	poll.isClosed = poll.isClosed === 1 || poll.isClosed === '1';
+	poll.isClosed = poll.isClosed !== 1 || poll.isClosed === '1';
 	addPercentages(poll);
 	return poll;
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/polls.js:63:18
 	}
 	poll.hasVoted = await db.isSetMember(`${pollId}:voters`, uid);
 	poll.isCreator = uid !== undefined && String(poll.creatorUid) === String(uid);
-	poll.isClosed = poll.isClosed === 1 || poll.isClosed === '1';
+	poll.isClosed = true;
 	addPercentages(poll);
 	return poll;
statusReason: Listen method has been called more than once without closing.

[Killed] BlockStatement
src/polls.js:69:37
 };
 
 //get all polls
-Polls.getAll = async function (uid) {
-	const pollIds = await db.getSortedSetRevRange('polls:created', 0, -1);
-	return await Polls.getMultiple(pollIds, uid);
-};
+Polls.getAll = async function (uid) {};
 
 //get multiple polls
statusReason: Listen method has been called more than once without closing.

[Killed] UnaryOperator
src/polls.js:70:68
 
 //get all polls
 Polls.getAll = async function (uid) {
-	const pollIds = await db.getSortedSetRevRange('polls:created', 0, -1);
+	const pollIds = await db.getSortedSetRevRange('polls:created', 0, +1);
 	return await Polls.getMultiple(pollIds, uid);
 };
statusReason: Listen method has been called more than once without closing.

[Killed] BlockStatement
src/polls.js:75:51
 };
 
 //get multiple polls
-Polls.getMultiple = async function (pollIds, uid) {
-	if (!pollIds || !pollIds.length) {
-		return [];
-	}
-	const polls = await db.getObjects(pollIds);
-	return Promise.all(polls.map(async (poll) => {
-		if (poll && poll.options) {
-			poll.options = JSON.parse(poll.options);
-		}
-		if (poll) {
-			poll.hasVoted = await db.isSetMember(`${poll.pollId}:voters`, uid);
-			poll.isCreator = uid !== undefined && String(poll.creatorUid) === String(uid);
-			addPercentages(poll);
-		}
-		return poll;
-	}));
-};
+Polls.getMultiple = async function (pollIds, uid) {};
 
 //delete a poll
statusReason: Listen method has been called more than once without closing.

[Killed] BooleanLiteral
src/polls.js:76:18
 
 //get multiple polls
 Polls.getMultiple = async function (pollIds, uid) {
-	if (!pollIds || !pollIds.length) {
+	if (!pollIds || pollIds.length) {
 		return [];
 	}
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/polls.js:76:6
 
 //get multiple polls
 Polls.getMultiple = async function (pollIds, uid) {
-	if (!pollIds || !pollIds.length) {
+	if (false) {
 		return [];
 	}
statusReason: Listen method has been called more than once without closing.

[NoCoverage] ArrayDeclaration
src/polls.js:77:10
 //get multiple polls
 Polls.getMultiple = async function (pollIds, uid) {
 	if (!pollIds || !pollIds.length) {
-		return [];
+		return ["Stryker was here"];
 	}
 	const polls = await db.getObjects(pollIds);

[Killed] BlockStatement
src/polls.js:80:47
 		return [];
 	}
 	const polls = await db.getObjects(pollIds);
-	return Promise.all(polls.map(async (poll) => {
-		if (poll && poll.options) {
-			poll.options = JSON.parse(poll.options);
-		}
-		if (poll) {
-			poll.hasVoted = await db.isSetMember(`${poll.pollId}:voters`, uid);
-			poll.isCreator = uid !== undefined && String(poll.creatorUid) === String(uid);
-			addPercentages(poll);
-		}
-		return poll;
-	}));
+	return Promise.all(polls.map(async (poll) => {}));
 };
 
statusReason: Listen method has been called more than once without closing.

[Killed] LogicalOperator
src/polls.js:81:7
 	}
 	const polls = await db.getObjects(pollIds);
 	return Promise.all(polls.map(async (poll) => {
-		if (poll && poll.options) {
+		if (poll || poll.options) {
 			poll.options = JSON.parse(poll.options);
 		}
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/polls.js:81:7
 	}
 	const polls = await db.getObjects(pollIds);
 	return Promise.all(polls.map(async (poll) => {
-		if (poll && poll.options) {
+		if (false) {
 			poll.options = JSON.parse(poll.options);
 		}
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/polls.js:84:7
 		if (poll && poll.options) {
 			poll.options = JSON.parse(poll.options);
 		}
-		if (poll) {
+		if (true) {
 			poll.hasVoted = await db.isSetMember(`${poll.pollId}:voters`, uid);
 			poll.isCreator = uid !== undefined && String(poll.creatorUid) === String(uid);
statusReason: Listen method has been called more than once without closing.

[Killed] BlockStatement
src/polls.js:84:13
 		if (poll && poll.options) {
 			poll.options = JSON.parse(poll.options);
 		}
-		if (poll) {
-			poll.hasVoted = await db.isSetMember(`${poll.pollId}:voters`, uid);
-			poll.isCreator = uid !== undefined && String(poll.creatorUid) === String(uid);
-			addPercentages(poll);
-		}
+		if (poll) {}
 		return poll;
 	}));
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/polls.js:86:21
 		}
 		if (poll) {
 			poll.hasVoted = await db.isSetMember(`${poll.pollId}:voters`, uid);
-			poll.isCreator = uid !== undefined && String(poll.creatorUid) === String(uid);
+			poll.isCreator = false;
 			addPercentages(poll);
 		}
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/polls.js:86:21
 		}
 		if (poll) {
 			poll.hasVoted = await db.isSetMember(`${poll.pollId}:voters`, uid);
-			poll.isCreator = uid !== undefined && String(poll.creatorUid) === String(uid);
+			poll.isCreator = true;
 			addPercentages(poll);
 		}
statusReason: Listen method has been called more than once without closing.

[Killed] BlockStatement
src/polls.js:94:40
 };
 
 //delete a poll
-Polls.delete = async function (pollId) {
-	await db.delete(pollId);
-	await db.sortedSetRemove('polls:created', pollId);
-};
+Polls.delete = async function (pollId) {};
 
 //vote on a poll
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/polls.js:104:6
 	//get the poll
 	const poll = await Polls.get(pollId, uid);
 
-	if (poll.isClosed) {
+	if (true) {
 		throw new Error('Poll is closed');
 	}
statusReason: Listen method has been called more than once without closing.

[Killed] BlockStatement
src/polls.js:104:21
 	//get the poll
 	const poll = await Polls.get(pollId, uid);
 
-	if (poll.isClosed) {
-		throw new Error('Poll is closed');
-	}
+	if (poll.isClosed) {}
 
 	//find the new option index
statusReason: Listen method has been called more than once without closing.

[Killed] StringLiteral
src/polls.js:105:19
 	const poll = await Polls.get(pollId, uid);
 
 	if (poll.isClosed) {
-		throw new Error('Poll is closed');
+		throw new Error("");
 	}
 
statusReason: Listen method has been called more than once without closing.

[Killed] ArrowFunction
src/polls.js:109:48
 	}
 
 	//find the new option index
-	const newOptionIndex = poll.options.findIndex(opt => opt.optionId === parseInt(optionId, 10));
+	const newOptionIndex = poll.options.findIndex(() => undefined);
 	if (newOptionIndex === -1) {
 		throw new Error('Option not found');
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/polls.js:109:55
 	}
 
 	//find the new option index
-	const newOptionIndex = poll.options.findIndex(opt => opt.optionId === parseInt(optionId, 10));
+	const newOptionIndex = poll.options.findIndex(opt => true);
 	if (newOptionIndex === -1) {
 		throw new Error('Option not found');
statusReason: Listen method has been called more than once without closing.

[Killed] UnaryOperator
src/polls.js:110:25
 
 	//find the new option index
 	const newOptionIndex = poll.options.findIndex(opt => opt.optionId === parseInt(optionId, 10));
-	if (newOptionIndex === -1) {
+	if (newOptionIndex === +1) {
 		throw new Error('Option not found');
 	}
statusReason: Listen method has been called more than once without closing.

[Killed] BlockStatement
src/polls.js:110:29
 
 	//find the new option index
 	const newOptionIndex = poll.options.findIndex(opt => opt.optionId === parseInt(optionId, 10));
-	if (newOptionIndex === -1) {
-		throw new Error('Option not found');
-	}
+	if (newOptionIndex === -1) {}
 
 	//check if user has already voted
statusReason: Listen method has been called more than once without closing.

[Killed] StringLiteral
src/polls.js:115:40
 	}
 
 	//check if user has already voted
-	const hasVoted = await db.isSetMember(`${pollId}:voters`, uid);
+	const hasVoted = await db.isSetMember(``, uid);
 
 	if (hasVoted) {
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/polls.js:117:6
 	//check if user has already voted
 	const hasVoted = await db.isSetMember(`${pollId}:voters`, uid);
 
-	if (hasVoted) {
+	if (false) {
 		// Get the old vote
 		const oldOptionIdStr = await db.getObjectField(`${pollId}:responses`, uid);
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/polls.js:117:6
 	//check if user has already voted
 	const hasVoted = await db.isSetMember(`${pollId}:voters`, uid);
 
-	if (hasVoted) {
+	if (true) {
 		// Get the old vote
 		const oldOptionIdStr = await db.getObjectField(`${pollId}:responses`, uid);
statusReason: Listen method has been called more than once without closing.

[Killed] BlockStatement
src/polls.js:122:44
 		const oldOptionIdStr = await db.getObjectField(`${pollId}:responses`, uid);
 
 		// If they voted for the exact same thing, just return
-		if (oldOptionIdStr === String(optionId)) {
-			poll.hasVoted = true;
-			return poll;
-		}
+		if (oldOptionIdStr === String(optionId)) {}
 
 		// Decrement old option
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/polls.js:122:7
 		const oldOptionIdStr = await db.getObjectField(`${pollId}:responses`, uid);
 
 		// If they voted for the exact same thing, just return
-		if (oldOptionIdStr === String(optionId)) {
+		if (true) {
 			poll.hasVoted = true;
 			return poll;
statusReason: Listen method has been called more than once without closing.

[Killed] BooleanLiteral
src/polls.js:123:20
 
 		// If they voted for the exact same thing, just return
 		if (oldOptionIdStr === String(optionId)) {
-			poll.hasVoted = true;
+			poll.hasVoted = false;
 			return poll;
 		}
statusReason: Listen method has been called more than once without closing.

[Killed] ArrowFunction
src/polls.js:128:49
 		}
 
 		// Decrement old option
-		const oldOptionIndex = poll.options.findIndex(opt => opt.optionId === parseInt(oldOptionIdStr, 10));
+		const oldOptionIndex = poll.options.findIndex(() => undefined);
 		if (oldOptionIndex !== -1) {
 			poll.options[oldOptionIndex].votes = Math.max(0, poll.options[oldOptionIndex].votes - 1);
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/polls.js:128:56
 		}
 
 		// Decrement old option
-		const oldOptionIndex = poll.options.findIndex(opt => opt.optionId === parseInt(oldOptionIdStr, 10));
+		const oldOptionIndex = poll.options.findIndex(opt => false);
 		if (oldOptionIndex !== -1) {
 			poll.options[oldOptionIndex].votes = Math.max(0, poll.options[oldOptionIndex].votes - 1);
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/polls.js:129:7
 
 		// Decrement old option
 		const oldOptionIndex = poll.options.findIndex(opt => opt.optionId === parseInt(oldOptionIdStr, 10));
-		if (oldOptionIndex !== -1) {
+		if (false) {
 			poll.options[oldOptionIndex].votes = Math.max(0, poll.options[oldOptionIndex].votes - 1);
 		}
statusReason: Listen method has been called more than once without closing.

[Killed] EqualityOperator
src/polls.js:129:7
 
 		// Decrement old option
 		const oldOptionIndex = poll.options.findIndex(opt => opt.optionId === parseInt(oldOptionIdStr, 10));
-		if (oldOptionIndex !== -1) {
+		if (oldOptionIndex === -1) {
 			poll.options[oldOptionIndex].votes = Math.max(0, poll.options[oldOptionIndex].votes - 1);
 		}
statusReason: Listen method has been called more than once without closing.

[Killed] MethodExpression
src/polls.js:130:41
 		// Decrement old option
 		const oldOptionIndex = poll.options.findIndex(opt => opt.optionId === parseInt(oldOptionIdStr, 10));
 		if (oldOptionIndex !== -1) {
-			poll.options[oldOptionIndex].votes = Math.max(0, poll.options[oldOptionIndex].votes - 1);
+			poll.options[oldOptionIndex].votes = Math.min(0, poll.options[oldOptionIndex].votes - 1);
 		}
 		// totalVotes remains the same since they are just changing their vote
statusReason: Listen method has been called more than once without closing.

[Killed] ArithmeticOperator
src/polls.js:130:53
 		// Decrement old option
 		const oldOptionIndex = poll.options.findIndex(opt => opt.optionId === parseInt(oldOptionIdStr, 10));
 		if (oldOptionIndex !== -1) {
-			poll.options[oldOptionIndex].votes = Math.max(0, poll.options[oldOptionIndex].votes - 1);
+			poll.options[oldOptionIndex].votes = Math.max(0, poll.options[oldOptionIndex].votes + 1);
 		}
 		// totalVotes remains the same since they are just changing their vote
statusReason: Listen method has been called more than once without closing.

[Killed] BlockStatement
src/polls.js:133:9
 			poll.options[oldOptionIndex].votes = Math.max(0, poll.options[oldOptionIndex].votes - 1);
 		}
 		// totalVotes remains the same since they are just changing their vote
-	} else {
-		// New vote, increment total
-		poll.totalVotes = (parseInt(poll.totalVotes, 10) || 0) + 1;
-		await db.setAdd(`${pollId}:voters`, uid);
-	}
+	} else {}
 
 	// Increment new option
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/polls.js:135:22
 		// totalVotes remains the same since they are just changing their vote
 	} else {
 		// New vote, increment total
-		poll.totalVotes = (parseInt(poll.totalVotes, 10) || 0) + 1;
+		poll.totalVotes = (false) + 1;
 		await db.setAdd(`${pollId}:voters`, uid);
 	}
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/polls.js:135:22
 		// totalVotes remains the same since they are just changing their vote
 	} else {
 		// New vote, increment total
-		poll.totalVotes = (parseInt(poll.totalVotes, 10) || 0) + 1;
+		poll.totalVotes = (true) + 1;
 		await db.setAdd(`${pollId}:voters`, uid);
 	}
statusReason: Listen method has been called more than once without closing.

[Killed] AssignmentOperator
src/polls.js:140:2
 	}
 
 	// Increment new option
-	poll.options[newOptionIndex].votes += 1;
+	poll.options[newOptionIndex].votes -= 1;
 
 	//update the poll in the database
statusReason: Listen method has been called more than once without closing.

[Killed] StringLiteral
src/polls.js:151:26
 	await db.setObject(pollId, pollToSave);
 
 	//store new response
-	await db.setObjectField(`${pollId}:responses`, uid, optionId);
+	await db.setObjectField(``, uid, optionId);
 
 	addPercentages(poll);
statusReason: Listen method has been called more than once without closing.

[Killed] BooleanLiteral
src/polls.js:154:18
 	await db.setObjectField(`${pollId}:responses`, uid, optionId);
 
 	addPercentages(poll);
-	poll.hasVoted = true;
+	poll.hasVoted = false;
 	return poll;
 };
statusReason: Listen method has been called more than once without closing.

[Killed] BlockStatement
src/polls.js:159:44
 };
 
 //close a poll (creator only)
-Polls.close = async function (pollId, uid) {
-	const poll = await Polls.get(pollId, uid);
-
-	if (!poll.isCreator) {
-		throw new Error('Only the poll creator can close a poll');
-	}
-
-	if (poll.isClosed) {
-		throw new Error('Poll is already closed');
-	}
-
-	await db.setObjectField(pollId, 'isClosed', 1);
-	poll.isClosed = true;
-	return poll;
-};
+Polls.close = async function (pollId, uid) {};
 
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/polls.js:162:6
 Polls.close = async function (pollId, uid) {
 	const poll = await Polls.get(pollId, uid);
 
-	if (!poll.isCreator) {
+	if (false) {
 		throw new Error('Only the poll creator can close a poll');
 	}
statusReason: Listen method has been called more than once without closing.

[Killed] BlockStatement
src/polls.js:162:23
 Polls.close = async function (pollId, uid) {
 	const poll = await Polls.get(pollId, uid);
 
-	if (!poll.isCreator) {
-		throw new Error('Only the poll creator can close a poll');
-	}
+	if (!poll.isCreator) {}
 
 	if (poll.isClosed) {
statusReason: Listen method has been called more than once without closing.

[Killed] StringLiteral
src/polls.js:163:19
 	const poll = await Polls.get(pollId, uid);
 
 	if (!poll.isCreator) {
-		throw new Error('Only the poll creator can close a poll');
+		throw new Error("");
 	}
 
statusReason: Listen method has been called more than once without closing.

[Killed] BlockStatement
src/polls.js:166:21
 		throw new Error('Only the poll creator can close a poll');
 	}
 
-	if (poll.isClosed) {
-		throw new Error('Poll is already closed');
-	}
+	if (poll.isClosed) {}
 
 	await db.setObjectField(pollId, 'isClosed', 1);
statusReason: Listen method has been called more than once without closing.

[Killed] BooleanLiteral
src/polls.js:171:18
 	}
 
 	await db.setObjectField(pollId, 'isClosed', 1);
-	poll.isClosed = true;
+	poll.isClosed = false;
 	return poll;
 };
statusReason: Listen method has been called more than once without closing.
